conjugateHeat/k3.0_noRadNoB/0/bottomAir/epsilon
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0/bottomAir";
    object      epsilon;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [ 0 2 -3 0 0 0 0 ];

internalField   uniform 0.01;

boundaryField
{
    bottomAir_bottom
    {
        type            symmetryPlane;
        value           uniform 0;
    }
    leftLet
    {
        type            inletOutlet;
        value           uniform 0.01;
        inletValue      uniform 0.01;
    }
    rightLet
    {
        type            fixedValue;
        value           uniform 0.01;
    }
    frontAndBack
    {
        type            empty;
    }
    bottomAir_to_wall
    {
        type            compressible::epsilonWallFunction;
        value           uniform 0.01;
    }
}


// ************************************************************************* //
