conjugateHeat/k3.0_noRadNoB/0/bottomAir/p_rgh
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0/bottomAir";
    object      p_rgh;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [ 1 -1 -2 0 0 0 0 ];

internalField   uniform 100000;

boundaryField
{
    bottomAir_bottom
    {
        type            symmetryPlane;
        value           uniform 0;
    }
    leftLet
    {
        type            fixedValue;
        value           uniform 100000;
    }
    rightLet
    {
        type            fixedFluxPressure;
        value           uniform 100000;
    }
    frontAndBack
    {
        type            empty;
    }
    bottomAir_to_wall
    {
        type            fixedFluxPressure;
        value           uniform 100000;
    }
}


// ************************************************************************* //
