conjugateHeat/k3.0_noRadNoB/0/topAir/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0/topAir";
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [ 0 2 -2 0 0 0 0 ];

internalField   uniform 0.1;

boundaryField
{
    topAir_top
    {
        type            symmetryPlane;
        value           uniform 0;
    }
    leftLet
    {
        type            inletOutlet;
        value           uniform 0.1;
        inletValue      uniform 0.1;
    }
    rightLet
    {
        type            fixedValue;
        value           uniform 0.1;
    }
    frontAndBack
    {
        type            empty;
    }
    topAir_to_wall
    {
        type            compressible::kqRWallFunction;
        value           uniform 0.1;
    }
}


// ************************************************************************* //
